export const siteConfig = {
  title: "BDFZ AI",
  description: "BDFZ AI",
  school: "北京大学附属中学",
  welcomeTitle: "欢迎使用 BDFZ AI",
  welcomeDescription: "BDFZ AI 是北京大学附属中学的专属的大语言模型。基于向量数据库，BDFZ AI 为您提供一站式的学校信息搜索服务。无论是规章制度、课程说明还是选课信息，只需一键查询，便可迅速找到所需内容，无需在各个平台繁琐查找。",
  schoolDocName: '学生手册',
  schoolDocLink: 'https://pkuschool.yuque.com/infodesk/sbook?#%20%E3%80%8A%E5%8C%97%E5%A4%A7%E9%99%84%E4%B8%AD%E5%AD%A6%E7%94%9F%E6%89%8B%E5%86%8C%E3%80%8B',
  emailDomain: ['i.pkuschool.edu.cn'],
  exampleMessages: [
    {
      heading: '我又迟到了',
      subheading: '会被处分吗？',
      message: `我现在已经迟到15分钟了，之前已经迟到过2次了，我会被处分吗？`,
      answer: '根据你提供的学校规定，迟到超过15分钟会被记录为缺席，且已经迟到过2次。根据学校的《7.3 考勤请假迟到制度》规定，如果学生迟到或早退超过15分钟，会被记为缺席。如果这已经是你第三次迟到超过15分钟，根据学校的处理规定，可能会受到处分，具体可能是警告或者严重警告的处分。\n建议你及时向学校相关部门请假或说明情况，尽量避免再次迟到，以减少可能面临的处分。'
    },
    {
      heading: '我想知道',
      subheading: '学校哪里适合自习?',
      message: '我想知道学校哪里适合自习',
      answer: '根据提供的文档内容，学校内适合自习的地点包括：\n' +
        '\n' +
        '图书馆三层：本部学生（含本部高三出国学生）在此自习。\n' +
        '高中楼五层创新工坊、六层开放空间：国际部学生在此自习。\n' +
        '北楼401：弘毅书院学生自习的地点。\n' +
        '高中楼三四层：其他书院学生的自习地点。\n' +
        '这些地点按照学院和部门的规定进行管理和安排，适合学生进行自主学习和完成任务。'
    },
    {
      heading: '怎么申请',
      subheading: '学校的荣誉文凭',
      message: `怎么申请学校的荣誉文凭？`,
      answer: '要申请北大附中的荣誉文凭，你需要按照以下步骤进行：\n' +
        '\n' +
        '申请资格确认：\n' +
        '\n' +
        '确保你已经获得北大附中的普通文凭。\n' +
        '平均学分积点需达到3.5以上。如果低于该积点，需要在申请文书中专门解释。\n' +
        '在书院内有明显的贡献或者社团组织成就。\n' +
        '在北大附中的培养目标中某一方面有突出表现或成果。\n' +
        '申请流程：\n' +
        '\n' +
        '在指定时间（6月13日至6月19日）内，到荣誉文凭申请库提交申请文书，按照指定模板完成。\n' +
        '文书需要详细说明你的学术成绩、贡献、成就以及如何符合荣誉文凭的标准。\n' +
        '初审与委员会审核：\n' +
        '\n' +
        '荣誉文凭委员会将对提交的申请进行线上初审。\n' +
        '委员会成员将依据设定的名额上限进行投票评审。\n' +
        '同时，书院议事会也会对本书院内的申请进行投票评审。\n' +
        '这两者的评审结果合并，按照票数排行产生最终的年度荣誉文凭获得者名单。\n' +
        '授予文凭：\n' +
        '\n' +
        '获得荣誉文凭的学生将在高三毕业典礼时正式授予。\n' +
        '在授予文凭之前，学生不得有未经消除的处分记录。\n' +
        '注意事项：\n' +
        '\n' +
        '如果在预科部高三或出国学习期间有“记过”或“留校察看”处分记录，之前的荣誉文凭申请结果将自动取消。\n' +
        '总之，要申请北大附中的荣誉文凭，除了学术成绩外，你还需要在学校和社团活动中有显著的贡献，并且需通过委员会和书院的严格评审程序。确保在申请期限内提交完整且符合要求的申请文书是非常重要的步骤。'
    },
    {
      heading: '艺术学分不够',
      subheading: `怎么能毕业？`,
      message: `我马上要高三下了，我目前只有4个艺术学分，我还需要上几门艺术课才能毕业？`,
      answer: '根据提供的信息，普通高中毕业需要至少获得144个学分。你目前已经有4个艺术学分，因此还需要获得总共至少140个学分才能毕业。\n' +
        '\n' +
        '具体到艺术课程的需求量没有具体提及，但你可以根据自己目前的学分情况，确认还需要修习多少门艺术课程才能达到毕业的学分要求。如果有关于具体学分和课程的疑问，建议向学校的教务处或相关负责人员咨询，以确保你的学业规划和选课符合要求。'
    }
  ]
}